-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 15 2018 г., 02:56
-- Версия сервера: 5.6.34
-- Версия PHP: 7.1.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `wtlrlrvl`
--
CREATE DATABASE IF NOT EXISTS `wtlrlrvl` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `wtlrlrvl`;

-- --------------------------------------------------------

--
-- Структура таблицы `blogarticles`
--

CREATE TABLE `blogarticles` (
  `id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `image` text,
  `body` text NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `blogarticles`
--

INSERT INTO `blogarticles` (`id`, `title`, `image`, `body`, `date`) VALUES
(116, 'куда без этого', '=)', 'Привет, Мир!', '2017-07-11 21:30:59'),
(117, 'Тест', '../../public/img/noimage.jpg', 'Тест, тест. Банально и необходимо (,но?).', '2017-07-11 21:31:31'),
(118, 'Тест', '../../public/img/noimage.jpg', 'check', '2017-07-11 21:31:40'),
(119, '4', '../../public/img/noimage.jpg', '4', '2017-07-11 21:31:43'),
(120, '5!', '../../public/img/noimage.jpg', '5', '2017-07-11 21:33:46'),
(122, 'Картинка NoImage', '../../public/img/noimage.jpg', 'Если добавлять публикацию через форму добавления и оставить пустую строку в графе изображения - добавиться картинка NoImage. Но при редактировании, ссылку можно исправить на что угодно, хоть на ту же пустую строку', '2017-07-11 21:33:53'),
(123, 'Доделал 6 лабораторную работу', '../../public/img/blog/minion.jpg', 'Все про все заняло у меня 14 дней.', '2017-07-12 17:18:38'),
(124, 'Какой твой любимый цвет?', '../../public/img/blog/pmap.jpg', '...', '2017-07-12 17:23:43'),
(126, 'О блоге', '../../public/img/blog/gubi.jpg', 'Что бы вести блог нужны мысли...или нет?', '2017-07-12 17:24:06'),
(127, 'Аватар', 'err://ups.fail.doh/noavatar', 'Аватар..аватар', '2017-07-12 17:24:18'),
(128, 'Федор Михайлович Достоевский', '../../public/img/blog/dostoevskii.jpg', 'любимый и уважаемый писатель', '2017-07-12 17:25:19'),
(129, 'Важная информация', '../../public/img/noimage.jpg', 'Важная информация пишется тут,\r\nснизу комментируется', '2017-07-12 17:30:02'),
(130, 'Эта запись тестовая', '../../public/img/noimage.jpg', 'Если 111 изменилось на это предложение -&gt; взять конфету или сделать перерыв!!', '2017-07-12 17:37:38'),
(134, 'Тут могла бы быть Ваша реклама', '../../public/img/blog/noads.jpg', 'Но я ее не добавил', '2017-07-12 18:36:17'),
(136, 'Что тебя интересует', '../../public/img/blog/vopros.jpg', 'Как принести пользу обществу?', '2017-07-12 18:36:10'),
(137, 'Илон Маск, кто', '../../public/img/blog/tesla.jpg', 'Реальный изобретатель, новый Конан Дойль или рекламное лицо?  Хороший предприниматель это ясно.', '2017-07-18 02:38:21'),
(199, 'Месси или Роналду', '../../public/img/blog/messi.jpg', 'Месси', '2017-07-18 22:26:48'),
(209, 'тема 1', '../../public/img/noimage.jpg', 'сообщение 1.\r\nИнтнересно эта публикация написана, пока я ещё не создал этот блог. Часы на ноуте сбились? Или ещё что то?', '2014-01-01 14:00:45'),
(210, 'мысль, интрига', '../../public/img/blog/kino.jpg', 'интрига, мысль, сюжет', '2014-01-01 14:01:59'),
(211, 'На сегодня', '../../public/img/noimage.jpg', 'это всё', '2014-01-01 14:02:13'),
(212, '8 работа!', '../../public/img/noimage.jpg', 'Закончил 8 лабу.\r\nКогда долго сидишь что бы закончить работу, тяжело написать что то кроме этого.\r\nПамятка. Не трогать код как бы ни хотелось, идти дальше. Все работает а время меньше и меньше!', '2017-09-16 00:20:13'),
(308, 'Тест успех', '../../public/img/noimage.jpg', 'Проверка!!!', '2017-10-16 21:46:27'),
(317, 'Новый', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTum-rv77UP_4rWaDHIkt0gk6wGv8qBQro74Ss8JthYpfh0QjtUng', 'Это кура', '2017-10-16 21:57:52'),
(318, 'Миньен', 'http://minionomaniya.ru/wp-content/uploads/2016/01/%D0%9A%D0%B5%D0%B2%D0%B8%D0%BD.jpg', 'Это миньен', '2017-10-17 00:48:45'),
(319, 'dsad', '../../public/img/noimage.jpg', 'dasd', '2017-10-19 20:25:10');

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `blogid` int(11) NOT NULL,
  `author` varchar(100) NOT NULL,
  `body` text NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `blogid`, `author`, `body`, `date`) VALUES
(125, 137, 'test', 'в', '2017-09-14 23:57:24'),
(126, 134, 'test', 'в', '2017-09-14 23:58:07'),
(127, 134, 'test', 'ва', '2017-09-15 00:03:40'),
(128, 134, 'test', 'о', '2017-09-15 00:04:28'),
(129, 136, 'test', '1', '2017-09-15 00:08:21'),
(130, 136, 'test', '5', '2017-09-15 00:08:48'),
(131, 136, 'test', '6', '2017-09-15 00:08:55'),
(132, 136, 'test', '7', '2017-09-15 00:09:34'),
(133, 136, 'test', 'н', '2017-09-15 00:09:39'),
(134, 137, 'test', 'еее', '2017-09-15 00:10:59'),
(135, 214, 'test', '1', '2017-09-15 00:12:04'),
(136, 214, 'test', '2', '2017-09-15 00:15:17'),
(137, 214, 'test', '3', '2017-09-15 00:15:49'),
(138, 134, 'test', 'а', '2017-09-15 00:23:59'),
(139, 134, 'test', 'с', '2017-09-15 00:24:36'),
(140, 134, 'test', 'а', '2017-09-15 00:24:54'),
(141, 136, 'test', 'в', '2017-09-15 00:25:23'),
(142, 136, 'test', 'и', '2017-09-15 00:25:52'),
(143, 199, 'test', 'к', '2017-09-15 00:27:45'),
(144, 134, 'test', '5', '2017-09-15 00:28:45'),
(145, 134, 'test', '6', '2017-09-15 00:29:41'),
(146, 126, 'test', '4', '2017-09-15 00:35:27'),
(147, 214, 'test', 'd', '2017-09-15 00:45:02'),
(148, 214, 'test', 'в', '2017-09-15 01:02:15'),
(149, 134, 'test', 'а', '2017-09-15 01:04:23'),
(150, 199, 'test', 'вав', '2017-09-15 01:04:44'),
(151, 130, 'test', '1', '2017-09-15 01:06:18'),
(152, 130, 'test', '2', '2017-09-15 01:06:21'),
(153, 130, 'test', '3', '2017-09-15 01:06:23'),
(154, 130, 'test', '4', '2017-09-15 01:06:26'),
(155, 130, 'test', '5', '2017-09-15 01:06:29'),
(156, 199, 'test', 'Роналду', '2017-09-18 00:29:02'),
(157, 199, 'test', 'Зидан', '2017-09-18 00:29:24'),
(158, 199, 'test', 'Ронадлу', '2017-09-18 00:29:32'),
(159, 130, 'test', 'Пишу коммент', '2017-09-18 00:29:58'),
(160, 199, 'hmnu16790', 'Люблю хоккей!', '2017-09-23 18:50:35'),
(161, 129, 'hmnu16790', 'Важный комментарий', '2017-10-13 22:30:27'),
(162, 128, 'hmnu16790', 'Мой любимый писатель!', '2017-10-13 22:37:55'),
(163, 128, 'hmnu16790', 'ит', '2017-10-13 22:53:40'),
(164, 127, 'hmnu16790', 'ыфвфыв', '2017-10-13 22:57:50'),
(165, 127, 'hmnu16790', 'фыв', '2017-10-13 23:00:46'),
(166, 127, 'hmnu16790', 'вфыввфыв', '2017-10-13 23:03:10'),
(167, 127, 'hmnu16790', 'вфыв', '2017-10-13 23:08:27'),
(168, 127, 'hmnu16790', 'фывфыв', '2017-10-13 23:09:07'),
(169, 127, 'hmnu16790', 'ввв', '2017-10-13 23:10:56'),
(170, 127, 'hmnu16790', 'фывф', '2017-10-13 23:11:51'),
(171, 127, 'hmnu16790', 'вфывфыв', '2017-10-13 23:12:47'),
(172, 127, 'hmnu16790', 'ghbd', '2017-10-13 23:16:04'),
(173, 130, 'hmnu16790', '6', '2017-10-13 23:20:03'),
(174, 129, 'hmnu16790', 'в', '2017-10-13 23:45:06'),
(175, 130, 'hmnu16790', 'а', '2017-10-14 00:03:19'),
(176, 130, 'hmnu16790', 'unique', '2017-10-14 00:05:32'),
(177, 130, 'hmnu16790', 'yyy', '2017-10-14 00:06:46'),
(178, 130, 'hmnu16790', 'asdsda', '2017-10-14 00:07:23'),
(179, 130, 'hmnu16790', 'ddd', '2017-10-14 00:08:46'),
(180, 130, 'hmnu16790', 'dsadas', '2017-10-14 00:13:50'),
(181, 130, 'hmnu16790', 'Привет Комменты!', '2017-10-14 00:15:26'),
(182, 130, 'hmnu16790', 'вввв', '2017-10-14 00:16:38'),
(183, 130, 'hmnu16790', 'ввфыв', '2017-10-14 00:17:12'),
(184, 130, 'hmnu16790', 'вфыв', '2017-10-14 00:19:29'),
(185, 130, 'hmnu16790', 'пвапаврр', '2017-10-14 00:20:52'),
(186, 130, 'hmnu16790', 'пвапаврр', '2017-10-14 00:21:07'),
(187, 130, 'hmnu16790', 'фыв', '2017-10-14 00:21:26'),
(188, 130, 'hmnu16790', 'фывфыв', '2017-10-14 00:21:51'),
(189, 130, 'hmnu16790', 'Hello, World!', '2017-10-14 00:22:58'),
(190, 130, 'hmnu16790', 'Hello, World 2!', '2017-10-14 00:23:12'),
(191, 126, 'hmnu16790', 'трес', '2017-10-14 00:26:58'),
(192, 126, 'hmnu16790', 'траст', '2017-10-14 00:27:49'),
(193, 127, 'hmnu16790', 'траст', '2017-10-14 00:27:54'),
(194, 128, 'hmnu16790', 'траст', '2017-10-14 00:27:59'),
(195, 129, 'hmnu16790', 'траст', '2017-10-14 00:28:04'),
(196, 130, 'hmnu16790', 'траст', '2017-10-14 00:28:10'),
(197, 118, 'hmnu16790', 'траст', '2017-10-14 00:28:24'),
(198, 117, 'hmnu16790', 'траст', '2017-10-14 00:28:30'),
(199, 116, 'hmnu16790', 'траст', '2017-10-14 00:28:35'),
(200, 118, 'hmnu16790', '.css', '2017-10-14 00:35:12'),
(201, 118, 'hmnu16790', '.css2', '2017-10-14 00:35:22'),
(202, 209, 'hmnu16790', 'close it!', '2017-10-14 00:36:53'),
(203, 124, 'hmnu16790', 'close it!', '2017-10-14 00:37:00'),
(204, 123, 'hmnu16790', 'close it!', '2017-10-14 00:37:06'),
(205, 122, 'hmnu16790', 'close it!', '2017-10-14 00:37:11'),
(206, 120, 'hmnu16790', 'close it!', '2017-10-14 00:37:16'),
(207, 120, 'hmnu16790', 'close it!', '2017-10-14 00:37:24'),
(208, 120, 'hmnu16790', 'close it!', '2017-10-14 00:38:10'),
(209, 119, 'hmnu16790', 'close it!', '2017-10-14 00:38:16'),
(210, 212, 'hmnu16790', 'laravel', '2017-10-14 00:43:49'),
(211, 212, 'yama', '5555', '2017-10-14 00:46:06'),
(212, 216, 'hmnu16790', 'ddd', '2017-10-14 23:01:22'),
(213, 317, 'veronikaOk', 'dasd', '2017-10-16 22:57:50'),
(214, 308, 'tigr', 'New comment', '2017-10-17 00:44:24'),
(215, 308, 'tigr', 'New comment', '2017-10-17 00:44:32'),
(216, 318, 'veronikaOk', 'Привет. Очень красивый миньен', '2017-10-19 20:23:38'),
(217, 318, 'veronikaOk', 'Привет.', '2017-10-19 20:23:46'),
(218, 318, 'veronikaOk', 'Ntcn', '2017-10-19 22:04:58'),
(219, 319, 'hmnu16790', 'Привет', '2017-10-20 21:34:28'),
(220, 317, 'hmnu16790', 'ddd', '2017-10-21 02:14:51'),
(221, 308, 'hmnu16790', 'asd', '2017-10-21 02:14:58'),
(222, 308, 'hmnu16790', 'Тест', '2017-10-21 02:15:20'),
(223, 123, 'hmnu16790', 'text', '2017-10-21 02:15:46');

-- --------------------------------------------------------

--
-- Структура таблицы `statistics`
--

CREATE TABLE `statistics` (
  `id` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `page` varchar(180) NOT NULL,
  `ip` varchar(30) NOT NULL,
  `host` varchar(180) NOT NULL,
  `browser_name` varchar(180) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `statistics`
--

INSERT INTO `statistics` (`id`, `date`, `page`, `ip`, `host`, `browser_name`) VALUES
(1, '0000-00-00 00:00:00', 'stat', 'stat', 'stat', 'stat'),
(2, '2017-07-26 15:17:24', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(3, '2017-07-26 15:50:29', '/', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/59.0.3071.115 Safari/537.36'),
(4, '2017-07-26 15:51:10', '/', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(5, '2017-07-26 16:57:57', '/study', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(6, '2017-07-26 16:57:58', '/photo', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(7, '2017-07-26 16:57:59', '/interests', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(8, '2017-07-26 16:58:01', '/photo', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(9, '2017-07-26 17:33:11', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(10, '2017-07-26 17:33:49', '/about', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(11, '2017-07-26 17:33:50', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(12, '2017-07-26 17:46:13', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(13, '2017-07-26 17:46:19', '/about', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(14, '2017-07-26 17:46:21', '/interests', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(15, '2017-07-26 17:46:22', '/study', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(16, '2017-07-26 17:46:23', '/photo', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(17, '2017-07-26 17:46:25', '/contact', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(18, '2017-07-26 17:46:29', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(19, '2017-07-26 17:46:31', '/guestbook', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(20, '2017-07-26 17:48:36', '/contact', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(21, '2017-07-26 17:49:17', '/contact', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(22, '2017-07-26 17:49:34', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(23, '2017-07-26 17:52:01', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(24, '2017-07-26 17:56:45', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(25, '2017-07-26 17:58:22', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(26, '2017-07-26 18:03:12', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(27, '2017-07-26 18:05:40', '/guestbook', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(28, '2017-07-26 18:05:44', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(29, '2017-07-26 18:05:50', '/contact', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(30, '2017-07-26 18:05:54', '/study', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(31, '2017-07-26 18:05:56', '/testpage', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(32, '2017-07-26 18:06:00', '/testpage', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(33, '2017-07-26 18:06:15', '/testpage', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(34, '2017-07-26 18:09:34', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(35, '2017-07-26 18:19:34', '/guestbook', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(36, '2017-07-26 18:20:31', '/guestbook', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(37, '2017-07-26 18:20:32', '/myblog', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(38, '2017-07-26 18:20:34', '/contact', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(39, '2017-07-26 18:20:37', '/study', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(40, '2017-07-26 18:20:38', '/interests', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(41, '2017-07-26 18:20:39', '/about', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(42, '2017-07-26 18:20:40', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(43, '2017-07-26 18:35:30', '/myblog?page=9', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(44, '2017-07-26 18:35:32', '/myblog?page=4', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(45, '2017-07-26 18:43:51', '/study', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(46, '2017-07-26 18:43:51', '/photo', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(47, '2017-07-26 18:44:14', '/photo', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(48, '2017-07-26 18:44:15', '/interests', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(49, '2017-07-26 18:44:15', '/about', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(50, '2017-07-26 18:44:28', '/about', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(51, '2017-07-26 18:44:29', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(52, '2017-07-26 18:44:30', '/index', '127.0.0.1', 'wtlr7', 'Mozilla/5.0 (Windows NT 6.1; rv:54.0) Gecko/20100101 Firefox/54.0'),
(53, '2017-10-12 19:38:49', '/study', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(54, '2017-10-12 19:38:53', '/testpage', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(55, '2017-10-12 19:38:53', '/photo', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(56, '2017-10-12 19:38:54', '/interests', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(57, '2017-10-12 19:38:55', '/about', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(58, '2017-10-12 19:38:55', '/', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(59, '2017-10-12 19:38:56', '/about', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(60, '2017-10-12 19:38:57', '/interests', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(61, '2017-10-12 19:38:57', '/study', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(62, '2017-10-12 19:38:58', '/photo', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(63, '2017-10-12 19:38:58', '/contact', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(64, '2017-10-12 19:39:10', '/testpage', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(65, '2017-10-12 19:39:11', '/interests', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(66, '2017-10-12 19:39:11', '/about', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(67, '2017-10-12 19:39:35', '/testpage', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(68, '2017-10-12 19:39:36', '/testpage', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(69, '2017-10-12 19:39:36', '/myblog', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(70, '2017-10-12 19:39:37', '/myblog', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(71, '2017-10-12 19:39:38', '/myblog', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(72, '2017-10-12 19:39:55', '/', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(73, '2017-10-12 19:39:56', '/', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(74, '2017-10-12 19:39:57', '/', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(75, '2017-10-12 19:40:03', '/guestbook', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(76, '2017-10-12 19:40:05', '/interests', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36'),
(77, '2017-10-12 19:40:06', '/about', '127.0.0.1', 'wtlr12', 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36');

-- --------------------------------------------------------

--
-- Структура таблицы `testresults`
--

CREATE TABLE `testresults` (
  `id` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `fio` varchar(50) NOT NULL,
  `groupname` varchar(10) NOT NULL,
  `answer1` varchar(50) NOT NULL,
  `result1` varchar(5) NOT NULL,
  `answer2` int(11) NOT NULL,
  `result2` varchar(5) NOT NULL,
  `answer3` varchar(20) NOT NULL,
  `result3` varchar(5) NOT NULL,
  `mark` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `testresults`
--

INSERT INTO `testresults` (`id`, `date`, `fio`, `groupname`, `answer1`, `result1`, `answer2`, `result2`, `answer3`, `result3`, `mark`) VALUES
(2, '2017-07-17 23:23:58', 'Сербин Александр Александр', 'ИС-41з', 'Система типов данных', 'ДА', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Отлично!'),
(8, '2017-07-18 00:17:04', 'Игнатов Андрей Евгеньевич', 'ИС-22', 'Совмещение нескольких парадигм программирования', 'НЕТ', 3072, 'ДА', 'Алан Тьюринг', 'НЕТ', 'Удовлетворительно'),
(9, '2017-07-18 00:43:03', 'Сербин Александр Александр', 'ИС-41з', 'Совмещение нескольких парадигм программирования', 'НЕТ', 3002, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно'),
(10, '2017-07-18 01:12:18', 'Ким Николаевна Кардашьян', 'ИС-51з', 'Система типов данных', 'ДА', 321, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Удовлетворительно'),
(11, '2017-07-18 01:29:57', 'Петр Васильевич Цирков', 'ИС-22', 'Система типов данных', 'ДА', 3072, 'ДА', 'Алан Тьюринг', 'НЕТ', 'Хорошо'),
(12, '2017-07-18 02:02:07', 'Сербин Александр Александр', 'ИС-51з', 'Гибкая система настройки', 'НЕТ', 22, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Провал!'),
(13, '2017-07-18 02:15:23', 'Николай Осипович Крюк', 'ИС-12', 'Кроссплатформенность', 'НЕТ', 7032, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Провал!'),
(14, '2017-07-18 16:46:48', 'Иван Андреевич Ургант', 'ИС-51', 'Кроссплатформенность', 'НЕТ', 4000, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно'),
(15, '2017-07-18 22:55:41', 'Сафин Марат Измайлович', 'ИС-11', 'Система типов данных', 'ДА', 3072, 'ДА', 'Блез Паскаль', 'НЕТ', 'Хорошо'),
(16, '2017-07-21 23:20:52', 'Сербин Александр А', 'ИС-11з', 'Гибкая система настройки', 'НЕТ', 6, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Провал!'),
(17, '2017-07-21 23:22:50', 'Сербин Александр Александрович', 'ИС-11з', 'Система типов данных', 'ДА', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Отлично!'),
(18, '2017-07-26 18:09:16', 'Петров Игорь Федорович', 'ИС-51', 'Гибкая система настройки', 'НЕТ', 432, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Провал!'),
(19, '2017-08-05 23:45:31', 'Маслов Ян Рогович', 'ИС-22', 'Кроссплатформенность', 'НЕТ', 32123, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно'),
(20, '2017-09-23 18:48:21', 'Маслов Ян Рогович', 'ИС-51з', 'Гибкая система настройки', 'НЕТ', 444, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно'),
(29, '2017-10-07 20:23:40', 'Лозинская Вероника Игоревна', 'ИС-41з', 'Система типов данных', 'ДА', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Отлично!'),
(30, '2017-10-07 20:24:05', 'Лозинская Вероника Игоревна', 'ИС-11', 'Гибкая система настройки', 'НЕТ', 7032, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно'),
(31, '2017-10-07 20:39:27', 'Гоголь Николай Иванович', 'ИС-41з', 'Система типов данных', 'ДА', 1254, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Удовлетворительно'),
(32, '2017-10-08 01:02:24', 'Достоевский Федор Михайлович', 'ИС-31з', 'Совмещение нескольких парадигм программирования', 'НЕТ', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Хорошо'),
(33, '2017-10-08 11:11:51', 'Андреев Илья Владимирович', 'ИС-12', 'Система типов данных', 'ДА', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Отлично!'),
(34, '2017-10-08 11:12:54', 'ввв ввв ввв', 'ИС-21', 'Кроссплатформенность', 'НЕТ', 456, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Провал!'),
(35, '2017-10-08 11:13:20', 'ввв ввв ввв', 'ИС-22', 'Система типов данных', 'ДА', 3333, 'НЕТ', 'Алан Тьюринг', 'НЕТ', 'Удовлетворительно'),
(36, '2017-10-14 00:53:26', 'Юдашев Дмитрий Антонович', 'ИС-21', 'Система типов данных', 'ДА', 1234, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Хорошо'),
(37, '2017-10-14 00:55:35', 'Юдашев Дмитрий Антонович', 'ИС-21', 'Система типов данных', 'ДА', 1234, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Хорошо'),
(38, '2017-10-14 00:56:06', 'Юдашев Дмитрий Антонович', 'ИС-41з', 'Система типов данных', 'ДА', 3072, 'ДА', 'Никлаус Вирт', 'ДА', 'Отлично!'),
(39, '2017-10-17 00:42:07', 'Юдашев Дмитрий Антонович', 'ИС-12', 'Гибкая система настройки', 'НЕТ', 6666, 'НЕТ', 'Никлаус Вирт', 'ДА', 'Удовлетворительно');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `fio` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `login` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `reg_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `fio`, `email`, `login`, `password`, `reg_date`) VALUES
(1, 'test', 'test@mail.ru', 'test', '098f6bcd4621d373cade4e832627b4f6', '0000-00-00 00:00:00'),
(2, 'Сербин Александр Александр', '2333@gmail.com', 'hmnu16790', 'f7e0b956540676a129760a3eae309294', '2017-08-01 22:44:16'),
(3, 'Иванов Иван Иванович', '123@gmail.com', 'ivanov', '202cb962ac59075b964b07152d234b70', '2017-08-04 17:49:15'),
(4, 'Маслов Ян Романович', 'pass@gmail.com', 'yama', '1a1dc91c907325c69271ddf0c944bc72', '2017-08-05 23:43:42'),
(5, 'Торопов Федор Филиппович', '4444@gmail.com', 'toropov', 'dbc4d84bfcfe2284ba11beffb853a8c4', '2017-08-21 16:54:44'),
(6, 'Филипп Владимирович Колопов', '8888@yandex.ru', 'kolfi', 'cf79ae6addba60ad018347359bd144d2', '2017-10-12 15:10:13'),
(8, 'Лозинская Вероника Игоревна', 'loza@icloud.com', 'veronikaOk', 'ee95a16d763ab0d26ee62c53056df928', '2017-10-16 22:35:11'),
(9, 'Ласов Илья Валентинович', 'lasov@mail.ru', 'tigr', '14a3ab4b0fd1d42a0fadd826863cc403', '2017-10-17 00:21:00');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `blogarticles`
--
ALTER TABLE `blogarticles`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `statistics`
--
ALTER TABLE `statistics`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `testresults`
--
ALTER TABLE `testresults`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `blogarticles`
--
ALTER TABLE `blogarticles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=320;
--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=224;
--
-- AUTO_INCREMENT для таблицы `statistics`
--
ALTER TABLE `statistics`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;
--
-- AUTO_INCREMENT для таблицы `testresults`
--
ALTER TABLE `testresults`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
